# 1)написати функцію на замикання котра буде в собі зберігати список справ, вам потрібно реалізувати два методи:
# - перший записує в список нову справу
# - другий повертає всі записи

# 2) протипізувати перше завдання

# 3) створити функцію котра буде повертати сумму розрядів числа у вигляді строки (також використовуемо типізацію)
# Приклад:
# expanded_form(12) # return '10 + 2'
# expanded_form(42) # return '40 + 2'
# expanded_form(70304) # return '70000 + 300 + 4'

def expanded_form(n):
    # Перетворюємо число в рядок
    number_to_str = str(n)

    # Визначаємо кількість розрядів числа
    number_digits = len(number_to_str)

    # Формуємо рядок для кожного розряду
    res = []
    for i, digit in enumerate(number_to_str):
        if digit != '0':
            res.append(str(int(digit) * 10 ** (number_digits - i - 1)))
    # Повертаємо суму рядків, розділену знаком " + "
    return ' + '.join(res)


print(expanded_form(8586))



# 4) створити декоратор котрий буде підраховувати скільки разів була запущена функція
# продекорована цим декоратором, та буде виводити це значення після виконання функцій